from Omamodule import*

nimi = input("Sisestage oma nimi: ")
nimi_arv = calculate_name_value(nimi, 'table.txt')
print(f"Teie nime number on {nimi_arv}")
if nimi_arv==1:
    print("""Значение числа имени 1 
Единица всегда и во все времена считалась символом лидерства.

Число имени 1 - лидерство 
Вы - первооткрыватель, вы помогаете людям отыскать пути после того как проложите их лично.
Ваша отличная черта - Отвага. Если вами будут пытаться командовать, то вы взбунтуетесь, но в чём-то вас можно и убедить.
У вас свой неповторимый стиль, своя собственная манера мышления.
Вы правильно судите о людях, смотрите в оба, поэтому вас сложно обмануть, только в особых случаях вы сможете не разглядеть обман.
Никогда не отступайте от выбранной цели, возможно, что вам придётся начать всё с самого начала. Лень - ваш главный враг. 
Число имени 1 - творчество 
Число имени 1 помогает людям быть активными и заниматься творческим трудом.
Да, можно полностью уйти в себя и не о чём не волноваться, но надо быть уверенным, что если возникнет проблема, ваш творческий ум сразу найдёт её решение.
Но данная уверенность - это не оправдание неосторожности, которое может привести к полному провалу.
Главное, что бы у вас не пропадало желание учиться и слушать других. Ваша натура - творческая и она может позволить вам всегда быть молодым, и ваши новые планы будут постоянно открывать вам доступ, к различным сферам деятельности.
Вы запросто можете опередить большинство, а это является залогом вашего морального удовлетворения: постоянно предвкушая тенденции, потребности и всеобщее настроение, в любой ситуации вы вырываетесь вперёд. 
Число имени 1 - высокомерие и эгоизм 
Если у вас при каких либо обстоятельствах не получается следовать своему числу выражения именно в его позитивном полюсе, то, возможно, вы проявляете такие негативные черты как эгоизм, высокомерие, агрессивность и даже склонности диктатора.
Вы сможете этого избежать, если будете помнить, что вы полны сил для свершения великих дел, не опираясь на традиции.
Вы постоянно сохраняете свою особенную индивидуальность и думаете, что каждый человек обязан свободно выражать себя.
Вы постоянно можете очутиться перед необходимостью справиться с проблемой в одиночку или самостоятельно принять решение, причём это решение может касаться помимо вас ещё и других людей, не наделённых качествами лидера.
Вы должны дорожить своей индивидуальностью и употреблять на благо человечества, щедро отмеренные вам силы.""")

elif nimi_arv==2:
    print("""Значение числа имени 2 
Значение числа имени два, черты характера
Главные качества человека с числом имени 2 – дипломатичность и сотрудничество. 
Вы всегда можете понять другого человека, принять его точку зрения, поэтому из вас выйдет хороший исполнитель любой работы или же деловой партнер. 
Вы можете общаться в любой компании и в любых слоях общества. 
Число имени 2 – искренность и тактичность 
Ваше миролюбие тянет к сопереживанию и помощи в разрешении проблем других людей. 
Используя свою интуицию, вы даже сможете исполнять роль психоаналитика для окружающих вас людей. 
Благодаря вашей искренности и тактичности, ваше мнение всегда очень весомо и принимается с благодарностью. 
При этом благодарность окружающих добавляет вам ощущение довольства и счастья. 
Вы умеете завоевать хорошее отношение к себе, отмечая в окружающих что-то хорошее. 
Ваши достижения всецело зависят от вашей организованности и от умения управлять своим временем. 
Сосредоточьтесь мысленно на своей цели и идите к ней. 
Число имени 2 – чувство юмора 
Человеку с числом имени 2 присуще отличное чувство юмора и способность отрешения от слишком серьезного отношения к жизненным проблемам. 
Не используйте эти качества для резкой критики окружающих, а лучше направьте свои аналитические возможности для дружеской помощи. 
Если вы позволите развиваться негативной стороне вашего числа имени, то станете лицемерны и тщеславны, люди будут использовать вам в своих интересах, причиняя страдания. 
Не нужно оплакивать вашу судьбу, а лучше возьмите себя в руки и будьте всегда готовы дать отчет о своих действиях. 
Кроме того, ваше миролюбие не должно перерастать в раболепие, в которое вы можете впасть, пытаясь угодить всем окружающим без разбора. 
Число имени 2 – сотрудничество 
Одно из главных достоинств людей с числом имени 2 – это верность сотрудничеству. 
Вам очень нравится помогать благополучию людей, обучать их чему-то новому, расширять круг их интересов. 
Вы искренне сопереживаете своим друзьям и заслуживаете репутацию честного человека. 
Вы можете свернуть с пути счастья только в одном случае – если измените своему добродушию, доставшемуся вам от рождения, и встанете на путь войны и вражды.
""")

elif nimi_arv==3:
    print("""Значение числа имени 3 
Люди с числом имени 3 видят красоту жизни и стараются показать её окружающим.
Ваша самая большая радость – в постоянной самоотдаче и служении людям.
Обладая ярчащим воображением и натурой художника, вы способны генерировать блестящие идеи.
Значение числа имени три, черты характера 
Число имени 3 – общение и дружба 
Вы всегда стремитесь к общению и дружбе, которые необходимы вам, как воздух.
Бывает, что ваше великодушие и участие в жизни других людей приносит неудовлетворенность и оборачивается истощением жизненных сил и денежных средств – друзья буквально разрывают вас на части.
Ваша романтичность позволяет сохранить молодость, а богатое воображение стремиться раскрасить серые будни в самые яркие цвета.
Вы – человек с юмором, всегда переполнены оптимизмом и готовностью веселиться. 
Вы неустанно ободряете всех грустных и тоскующих людей. Друзья, мучающиеся в тревогах и депрессии, обращаются за помощью именно к вам. 
Именно это делает вас популярным. Очень важно не растрачивать свой талант, силы и время впустую, а также не сорить деньгами. 
В случае негативного сценария числа имени 3 это вполне возможно, так что будьте осторожны! 
Вас очень увлекают именно новые мысли и образы, поэтому старайтесь хотя бы иногда их воплощать в жизнь, а не только придумывать. 
Ваша излишняя эмоциональность и порывистость тоже может стать негативной стороной вашего числа имени. 
Число имени 3 – искусство и красота 
Вас очень привлекает искусство, особенно, театр, музыка, танец; обязательно попробуйте себя на сцене. 
Вы очень любите красивую речь и страстно увлекаетесь голосовыми качествами – своими и других людей. 
Благодаря умению красиво говорить, вы производите впечатление образованного и умного человека. Изящество – ваша вторая натура. 
Вы всегда стремитесь окружать себя красотой – красивыми вещами, красивыми людьми. 
Жизнь других людей тоже изменяется к лучшему, когда начинают видеть красоту во всем, как и вы. 
Это ваше качество становится образцом для подражания.""")

elif nimi_arv==4:
    print("""Значение числа имени 4 
Люди с числом имени 4 обладают решительностью и в мыслях, и поступках. 
Вы всегда производите хорошее впечатление за счет постоянства и следования правилам. 
Значение числа имени четыре, черты характера 
Число имени 4 – безопасность 
У вас есть чувство внутреннего ритма, которые и определяет ваше мышление и размеренные действия. 
Подобно строителю вы блок за блоком создаете всё вокруг себя – круг общения, карьеру, домашние дела. 
Вы не можете допускать легкомыслие и небрежность. 
Именно поэтому ваши друзья и близкие чувствуют себя в безопасности рядом с вами, т.к. уверены в вашей подготовке и о том, что вы всё заранее продумали и обо всем позаботились. 
Все ваши знакомые верят, что на вас можно положиться. 
Число имени 4 – честность 
Символом вашей веры является честность. 
Вы несете этот принцип в своей жизни и требуете от окружающих так же быть честными с вами. 
Число имени 4 – практичность и организованность 
Вы не витаете в облаках и не ищите романтики, ведь вы – очень практичный человек. 
Вы предпочитаете надежные поступки, с минимум риска. Вы всегда знаете, что у вас впереди, способны предвидеть развитие ситуации. 
Вы не полагаетесь на счастливую случайность и не ищите доходов, падающих с неба. 
Вы понимаете, что всё достигается упорным трудом и рассчитываете только на свои силы. 
Обладая высокой самоорганизованностью, вы всегда можете привести мысли в порядок, поразмышлять о своих делать и выделить наиболее перспективные направления. 
Полюбите свое число имени и не впадайте в зависть к другим людям, более темпераментным и склонным к риску. 
С помощью своей организованности и честности вы сможете достичь высокого положения в обществе.
""")
elif nimi_arv==5:
    print("""Значение числа имени 5 
У людей с числом имени 5 безграничное стремление к свободе, и ничто не может удержать их против их воли. 
Люди-пятерки очень любопытны и постоянно ищут новые места и для удовлетворения своего любопытства. 
Значение числа имени пять, черты характера 
Число имени 5 – дружелюбие и тяга к приключениям 
Вы уважаете дружбу и хорошо приспосабливаетесь к любым обстоятельствам. 
За это вас любят и ждут в любых компаниях и обществах. 
Вы обладаете творческим воображением и готовы воплощать идеи словестно, поэтому часто выбираете род деятельности, где ценится красота слова – литературу, радио и т.п. 
Вы всегда стремитесь увидеть новые места, повидать мир, пообщаться с новыми людьми. 
У вас никогда не хватит терпения долго оставаться на одном месте, чтобы действительно близко сойтись с какими-то людьми. 
Весьма ценным вашим качеством является сильное желание постоянно расширять круг своих интересов и отказываться от проторенных путей. 
Однако вы должны использовать свои силы и возможности только во благо общества. 
Число имени 5 – стремление к удовольствиям 
Если вы утратите решимость и начнете сомневаться в своих действиях, то тяга к приключениям приведет вас к растерянности и несчастьям. 
Спасение от этих противоречий вы находите в постоянном получении удовольствий, что несет явную опасность. 
Поэтому не теряйте решимости, всегда будьте готовы принять брошенный вызов. 
Гордо встречайте любую неизвестность и вы победите! 
Путешествуйте по жизни на легке, это поможет легче преодолевать препятствия. 
Число имени 5 – вспыльчивость 
Негативной стороной числа имени 5 может быть излишняя подверженность эмоциям и несдержанность характера. 
Такие люди могут постоянно спорить и врать. 
Вам необходимо взять себя в руки, учиться терпимости и умению понять окружающих.
""")
elif nimi_arv==6:
    print("""Значение числа имени 6 
Людей с числом имени 6 привлекают обязательства, т.к. они очень любят чувство ответственности. 
Умея находить выход из любой ситуации, вы можете стать опорой для друзей и знакомых. 
Однако не стоит хвататься за все трудности и решать все проблемы других людей, 
направьте свою энергию на решение только самых важных задач и научите друзей побеждать трудности самостоятельно. 
Вы – луч света и проводник пути для своих близких и друзей, хранитель домашнего очага и наставник. 
Значение числа имени шесть, черты характера 
Число имени 6 – стремление к справедливости 
Вы стремитесь к вселенской справедливости и прекрасно знаете золотое правило: "поступай с другими так, как хочешь, чтобы поступали с тобой". 
При этом, вы готовы поступать так первым и не ждать ответного вознаграждения, потому что это позволяет вам жить полноценной жизнью и обрести душевный покой и удовлетворение. 
Судьба всегда отвечает вам взаимностью и отовсюду дарит приятные мелочи, неожиданно, но заслуженно. 
Вас привлекает непринужденная домашняя обстановка и гостеприимство. 
Число имени 6 – чувство прекрасного Число имени 6 даёт людям чувство прекрасного. 
Скорее всего, вы очень любите спокойную музыку, изобразительное искусство и красивый ландшафтный дизайн. 
Вы стремитесь к красоте и гармонии, одухотворяя всех, с кем вас сводит жизнь. 
Последние качества могут быть решающими в пользу выбора вас в качестве лучшего партнера для создания семьи. 
Число имени 6 – логика 
Вы хорошо дружите с логикой и способны вести интеллектуальные беседы на очень высоком уровне. 
При этом, что очень важно, вы никогда не поучаете, но излагаете свою точку зрения, которая не встречает возражений. 
В совокупности со стремлением к справедливости, умение рассуждать логично собирает вокруг вас всех друзей и знакомых, чтобы вы помогли им разрешить их споры. 
Ваши советы будут просты и разумны, а помощь – быстрой. 
Вас всегда выручит умение быстро принимать решение, основываясь на человеколюбии, большом уме и высокой морали. 
И никогда не отступайте от своих правильных принципов, особенно в периоды сильных эмоций (воодушевления или грусти). 
Вы – великий гуманист, и никакие преграды не должны останавливать вас на пути к высоким целям!
""")
elif nimi_arv==7:
    print("""""")